
Public Class 临时工具

    Dim s As String = "life is so bad.
如果按照我的话来说的话，

主站
音频
游戏中心
直播
会员购
BML
萌战
 下载APP
投 稿

大会员
消息
动态
稍后再看
收藏夹
历史

暗藏小心机的开学妆

更换头像
戈登走过去
粉

微博：@戈登走过去 个人网站 Walkedby.com
视角： 我自己
大会员剩余时间： 不足一天
头图皮肤套装
自定义头图

主页动态投稿167频道 7 收藏夹 4 订阅设置
搜索视频
关注数

110

粉丝数

8345

播放数

107.2万

阅读数

1955

戈登走过去戈登走过去动态投稿167频道 7 收藏夹 4 订阅设置
搜索视频
关注数

110

粉丝数

8345

播放数

107.2万

阅读数

1955

我的粉丝会看到新访客会看到
01:48
多人游戏现状翻拍 @戈登走過去
9148 58 5-12
相关游戏: Half-Life 简介补充: 原视频：ONLINE GAMING COMMUNITY IN A NUTSHELL av21743813


我的视频163更多
最新发布最多播放最多收藏
6.小技巧【GMod短片制作教程】@戈登走過去02:52
6.小技巧【GMod短片制作教程】@戈登走過去
475 8-28
5.定格动画制作【GMod短片制作教程】@戈登走過去03:37
5.定格动画制作【GMod短片制作教程】@戈登走過去
563 8-27
4.实用插件推荐【GMod短片制作教程】@戈登走過去03:00
4.实用插件推荐【GMod短片制作教程】@戈登走過去
733 8-26
3.实用指令【GMod短片制作教程】@戈登走過去04:46
3.实用指令【GMod短片制作教程】@戈登走過去
780 8-25
2.我拍短片的一般流程【GMod短片制作教程】@戈登走過去03:42
2.我拍短片的一般流程【GMod短片制作教程】@戈登走過去
836 8-24
1.我不用SFM【GMod短片制作教程】@戈登走過去01:53
1.我不用SFM【GMod短片制作教程】@戈登走過去
1381 8-23
弗里曼历险记2 @戈登走過去00:49
弗里曼历险记2 @戈登走過去
3864 8-18
暗能 @戈登走過去03:16
暗能 @戈登走過去
2779 8-11
黑山基地东区 @戈登走過去03:11
黑山基地东区 @戈登走過去
4479 8-4
半条命III @戈登走過去01:37
半条命III @戈登走過去
4468 7-27
谦虚 @戈登走過去00:49
谦虚 @戈登走過去
2847 7-19
一个悲剧 @戈登走過去02:43
一个悲剧 @戈登走過去
5170 7-10
试着恶搞半条命2 @戈登走過去01:12
试着恶搞半条命2 @戈登走過去
7834 6-23
错错错 @戈登走過去02:43
错错错 @戈登走過去
4236 6-16
弗里曼砸网吧 @戈登走過去00:58
弗里曼砸网吧 @戈登走過去
1.2万 6-10
GTA：黑山基地 @戈登走過去01:30
GTA：黑山基地 @戈登走過去
5892 6-7
惹到罪恶都市的老大的下场 @戈登走過去00:26
惹到罪恶都市的老大的下场 @戈登走過去
1.4万 5-26
我的一天 @戈登走過去02:48
我的一天 @戈登走過去
6468 5-20
多人游戏现状翻拍 @戈登走過去01:48
多人游戏现状翻拍 @戈登走過去
9148 5-12
侠盗飞车：17号城市 @戈登走過去01:22
侠盗飞车：17号城市 @戈登走過去
9319 4-29
如果其他游戏在GMod里 第5集 @戈登走過去02:14
如果其他游戏在GMod里 第5集 @戈登走過去
5495 4-21
【欧爷】真正的男人不需要血包【GMod短片】 @戈登走過去01:20
【欧爷】真正的男人不需要血包【GMod短片】 @戈登走過去
5493 4-15
半条命：自由城之章 @戈登走過去02:23
半条命：自由城之章 @戈登走過去
6431 4-5
TX代理GMod内测试玩视频 @戈登走過去02:56
TX代理GMod内测试玩视频 @戈登走過去
5720 4-2
用GTA4打开半条命2 @戈登走過去01:01
用GTA4打开半条命2 @戈登走過去
1.2万 3-26
我的频道新建
丢脸国的故事 3 稍后再看更多
丟臉國的故事 @戈登走過去 02:43
丟臉國的故事 @戈登走過去
1875 2017-6-8
大佬國的故事 @戈登走過去 02:30
大佬國的故事 @戈登走過去
1882 2017-6-9
地雷國的故事 @戈登走過去 02:19
地雷國的故事 @戈登走過去
2070 2017-9-6
恶搞半条命 3 稍后再看更多
试着恶搞半条命2 @戈登走過去 01:12
试着恶搞半条命2 @戈登走過去
7834 6-23
黑山基地东区 @戈登走過去 03:11
黑山基地东区 @戈登走過去
4479 8-4
暗能 @戈登走過去 03:16
暗能 @戈登走過去
2779 8-11
敖厂长大战腾讯特工 5 稍后再看更多
【GMod搞笑短片】敖厂长大战腾讯特工 第4集(误) @戈登短片工厂 02:20
【GMod搞笑短片】敖厂长大战腾讯特工 第4集(误) @戈登短片工厂
2.8万 2016-7-30
【GMod搞笑短片】敖厂长大战腾讯特工 第3集（大结局） @戈登短片工厂 02:07
【GMod搞笑短片】敖厂长大战腾讯特工 第3集（大结局） @戈登短片工厂
1.4万 2016-7-14
【GMod搞笑短片】敖厂长大战腾讯特工 第2集 @戈登短片工厂 02:21
【GMod搞笑短片】敖厂长大战腾讯特工 第2集 @戈登短片工厂
1.2万 2016-7-12
【GMod搞笑短片】敖厂长大战腾讯特工 第1集 @戈登短片工厂 02:20
【GMod搞笑短片】敖厂长大战腾讯特工 第1集 @戈登短片工厂
2.5万 2016-7-8
【GMod搞笑短片电影】敖厂长大战腾讯特工 番外篇 @戈登短片工厂 02:06
【GMod搞笑短片电影】敖厂长大战腾讯特工 番外篇 @戈登短片工厂
4723 2016-8-5
评论·脑残翻拍 9 稍后再看更多
第9次 评论·脑残翻拍【GMod短片】@戈登走過去 02:42
第9次 评论·脑残翻拍【GMod短片】@戈登走過去
7078 3-8
第8次 評論-腦殘翻拍【GMod短片】@戈登走過去 02:24
第8次 評論-腦殘翻拍【GMod短片】@戈登走過去
5018 2017-8-31
第7次 評論-腦殘翻拍【GMod短片】@戈登走過去 03:38
第7次 評論-腦殘翻拍【GMod短片】@戈登走過去
5546 2017-7-12
第6次 評論-腦殘翻拍[GMod短片]@戈登走過去 02:20
第6次 評論-腦殘翻拍[GMod短片]@戈登走過去
6345 2017-5-28
第五次 评论·脑残翻拍【GMod短片】@戈登走过去 04:04
第五次 评论·脑残翻拍【GMod短片】@戈登走过去
5957 2017-4-20
GMod基础教程 4 稍后再看更多
【GMod基础教程】01-03合集 @戈登短片工厂 24:25
【GMod基础教程】01-03合集 @戈登短片工厂
2139 2016-9-15
【GMod基础教程】06.联机礼仪 @戈登短片工厂 05:02
【GMod基础教程】06.联机礼仪 @戈登短片工厂
1013 2016-9-1
【GMod基础教程】05.疑难杂症：菜单消失，素材不见，无限更新 @戈登短片工厂 06:37
【GMod基础教程】05.疑难杂症：菜单消失，素材不见，无限更新 @戈登短片工厂
1033 2016-8-30
【GMod基础教程】04.简单P2P服务器联机开服教程 @戈登短片工厂 02:59
【GMod基础教程】04.简单P2P服务器联机开服教程 @戈登短片工厂
1104 2016-7-26
如果其他游戏在 GMod 里 4 稍后再看更多
如果其他游戏在GMod里 第5集 @戈登走過去 02:14
如果其他游戏在GMod里 第5集 @戈登走過去
5495 4-21
【GMod搞笑短片】如果其他游戏在gmod里  @戈登短片工厂 02:38
【GMod搞笑短片】如果其他游戏在gmod里 @戈登短片工厂
9819 2016-7-16
【GMod搞笑短片】如果其他游戏在gmod里 第2集 @戈登短片工厂 03:12
【GMod搞笑短片】如果其他游戏在gmod里 第2集 @戈登短片工厂
6264 2016-9-14
如果其他游戏在gmod里 第4集【GMod短片】@戈登走过去 03:28
如果其他游戏在gmod里 第4集【GMod短片】@戈登走过去
1.5万 2017-3-4
走過去是怎么样拍短片的 6 稍后再看更多
6.小技巧【GMod短片制作教程】@戈登走過去 02:52
6.小技巧【GMod短片制作教程】@戈登走過去
475 8-28
5.定格动画制作【GMod短片制作教程】@戈登走過去 03:37
5.定格动画制作【GMod短片制作教程】@戈登走過去
563 8-27
4.实用插件推荐【GMod短片制作教程】@戈登走過去 03:00
4.实用插件推荐【GMod短片制作教程】@戈登走過去
733 8-26
3.实用指令【GMod短片制作教程】@戈登走過去 04:46
3.实用指令【GMod短片制作教程】@戈登走過去
780 8-25
2.我拍短片的一般流程【GMod短片制作教程】@戈登走過去 03:42
2.我拍短片的一般流程【GMod短片制作教程】@戈登走過去
836 8-24
订阅番剧更多
欢迎来到加帕里公园
欢迎来到加帕里公园
坐落在这个世界的某个角落的超大型综合动物园「加帕里公园」，依靠着那里的神秘物质「砂之星」的力量，动物...

珈百璃的堕落
 珈百璃的堕落
天使学校的首席天使来到了地球！ ……但是，住惯了地球的她，开始过起整天逃学打网游的自甘堕落生活。 ...

超次元游戏 海王星
 超次元游戏 海王星
【本片翻译由澄空字幕组提供】一个由四位女神所守护的异世界，因为女神们千年来不断的争执而使得下界充满了...

兽娘动物园
 兽娘动物园
有各种动物充满谜团的，游戏内包含有众多少女化的动物，并且能和她们做朋友，而本次动画化...

订阅标签仅自己可见
我的收藏夹4更多
公开
默认收藏夹
公开
教程
公开
電影
公开
相聲小品收藏
最近投币的视频 21仅自己可见
Chinese Java Edition + PE Update Showcase 2018 Summer
Chinese Java Edition + PE Update Showcase 2018 Summer
66 10
【多明星】燃烧我的打游戏
【多明星】燃烧我的打游戏
32.1万 2391
催更党的愤怒【gmod短片】
催更党的愤怒【gmod短片】
36 0
【官方双语】HDR终于有标准啦：飞利浦436M6评测#linus谈科技
【官方双语】HDR终于有标准啦：飞利浦436M6评测#linus谈科技
3.7万 306
[动画Shorts] Repeater
[动画Shorts] Repeater
103 2
【初音11周年】甜蜜歌声与苦涩步伐【原创PV付】
【初音11周年】甜蜜歌声与苦涩步伐【原创PV付】
8万 2715
狗的报恩
狗的报恩
2.2万 579
把半条命2第一章的10首BGM一起播放 @戈登走过去
把半条命2第一章的10首BGM一起播放 @戈登走过去
653 0
【呆呆酱】红昭愿
【呆呆酱】红昭愿
502 2
【BIO4】鸡汤带你22分钟了解~生化危机4
【BIO4】鸡汤带你22分钟了解~生化危机4
422 10
法棍有多硬？留法理科生做了一个实验 - 留法周记EP36
法棍有多硬？留法理科生做了一个实验 - 留法周记EP36
13.7万 1636
【敖厂长】日本殿堂级游戏革新之路
【敖厂长】日本殿堂级游戏革新之路
137万 1.1万
家乡最好，基友最亲
家乡最好，基友最亲
2.5万 813
【GMOD自制短片】So Cold （倍感寒冷）
【GMOD自制短片】So Cold （倍感寒冷）
1792 13
【敖厂长】2017年最烂RPG
【敖厂长】2017年最烂RPG
256万 1.7万
安卓手机很卡顿.mp4
安卓手机很卡顿.mp4
616 5
[自制半条命SFM]抒情向:The End of Half-Life
[自制半条命SFM]抒情向:The End of Half-Life
783 5
如果游戏人物和玩家同时死亡
如果游戏人物和玩家同时死亡
2489 39
我的相簿3更多
9P
今天又去了一次永康，得到了俩位大佬的招待 @大情情情绪 @KN_冰魂 Σ(ﾟдﾟ;)
1.1万58
7P
Garry's Mod 真的不是 Valve 的，只是 Valve 发行而已。至于什么 CS 之父就更胡扯了。 （资料来自 Wikipedia 等，有错请指出）
908151
3P
新头像 released. （什么时候我才可以真的趴在被炉上呢） ​​​​
687248
我的专栏1更多
GMod 传奇：《Haven》的诞生
翻译：戈登走過去译者注：本文的原文是刊登在 GMod 官方博客里的文章《GMod Stories: The Making of Haven》，授权进行转载和翻译。本文原作者是 Craig Pearso

单机游戏195580102-6
获得 bilibili 认证，享受多重认证福利！
点此申请 bilibili 认证
获得 bilibili 认证，享受多重认证福利！
创作中心 
视频投稿投稿管理
为TA充电
共 91人
公告

微博：@戈登走过去
9/150
4523834 注册于 2014-6-14
 01-24
直播间
前往我的直播间
sad!@#@!#!#!dd"

    Private Sub Button1_Click(sender As Object, e As EventArgs) Handles Button1.Click
        写加密文件("e:\s.txt", s)
        PRT(s.GetHashCode, "write")
    End Sub

    Private Sub Button2_Click(sender As Object, e As EventArgs) Handles Button2.Click
        Dim f As String = 读加密文件("e:\s.txt")
        写文件("e:\d.txt", f)
        PRT(f, f.GetHashCode, "what now")
    End Sub

End Class